; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-73)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 - object)
 (:init 
    (arm-empty)
    (clear b4)
    (on b4 b17)
    (on b17 b7)
    (on b7 b3)
    (on b3 b10)
    (on b10 b19)
    (on b19 b1)
    (on b1 b22)
    (on b22 b8)
    (on b8 b11)
    (on b11 b16)
    (on b16 b20)
    (on b20 b2)
    (on b2 b18)
    (on b18 b9)
    (on b9 b14)
    (on b14 b12)
    (on-table b12)
    (clear b13)
    (on b13 b6)
    (on b6 b21)
    (on b21 b15)
    (on b15 b5)
    (on-table b5))
 (:goal (and 
(on-table b6)
(on-table b3)
(on-table b1)
(on-table b11)
(on b2 b11)
(on b7 b6)
(on b8 b1)
(on b10 b3)
(clear b12) (on b12 b2)
(on b15 b8)
(clear b22) (on b22 b7)
(on b9 b10)
(clear b13) (on b13 b15)
(on b19 b9)
(on b14 b19)
(on b4 b14)
(on b16 b4)
(on b5 b16)
(on b20 b5)
))
)

; plan
1. (unstack b13 b6)
   deleted: (on b13 b6) (clear b13) (arm-empty)
   added: (holding b13) (clear b6)
   goals met: 0 of 22
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 22
3. (unstack b6 b21)
   deleted: (on b6 b21) (clear b6) (arm-empty)
   added: (holding b6) (clear b21)
   goals met: 1 of 22
4. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 22
5. (unstack b4 b17)
   deleted: (on b4 b17) (clear b4) (arm-empty)
   added: (holding b4) (clear b17)
   goals met: 2 of 22
6. (stack b4 b21)
   deleted: (clear b21) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b21)
   goals met: 2 of 22
7. (unstack b17 b7)
   deleted: (on b17 b7) (clear b17) (arm-empty)
   added: (holding b17) (clear b7)
   goals met: 2 of 22
8. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 22
9. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 2 of 22
10. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 3 of 22
11. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 3 of 22
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 22
13. (unstack b10 b19)
   deleted: (on b10 b19) (clear b10) (arm-empty)
   added: (holding b10) (clear b19)
   goals met: 4 of 22
14. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 5 of 22
15. (unstack b19 b1)
   deleted: (on b19 b1) (clear b19) (arm-empty)
   added: (holding b19) (clear b1)
   goals met: 5 of 22
16. (stack b19 b17)
   deleted: (clear b17) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b17)
   goals met: 5 of 22
17. (unstack b1 b22)
   deleted: (on b1 b22) (clear b1) (arm-empty)
   added: (holding b1) (clear b22)
   goals met: 6 of 22
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 22
19. (unstack b22 b8)
   deleted: (on b22 b8) (clear b22) (arm-empty)
   added: (holding b22) (clear b8)
   goals met: 6 of 22
20. (stack b22 b7)
   deleted: (clear b7) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b7)
   goals met: 8 of 22
21. (unstack b8 b11)
   deleted: (on b8 b11) (clear b8) (arm-empty)
   added: (holding b8) (clear b11)
   goals met: 8 of 22
22. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 9 of 22
23. (unstack b11 b16)
   deleted: (on b11 b16) (clear b11) (arm-empty)
   added: (holding b11) (clear b16)
   goals met: 9 of 22
24. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 10 of 22
25. (unstack b16 b20)
   deleted: (on b16 b20) (clear b16) (arm-empty)
   added: (holding b16) (clear b20)
   goals met: 10 of 22
26. (stack b16 b8)
   deleted: (clear b8) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b8)
   goals met: 10 of 22
27. (unstack b20 b2)
   deleted: (on b20 b2) (clear b20) (arm-empty)
   added: (holding b20) (clear b2)
   goals met: 10 of 22
28. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 10 of 22
29. (unstack b2 b18)
   deleted: (on b2 b18) (clear b2) (arm-empty)
   added: (holding b2) (clear b18)
   goals met: 10 of 22
30. (stack b2 b11)
   deleted: (clear b11) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b11)
   goals met: 11 of 22
31. (unstack b18 b9)
   deleted: (on b18 b9) (clear b18) (arm-empty)
   added: (holding b18) (clear b9)
   goals met: 11 of 22
32. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 11 of 22
33. (unstack b9 b14)
   deleted: (on b9 b14) (clear b9) (arm-empty)
   added: (holding b9) (clear b14)
   goals met: 11 of 22
34. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 12 of 22
35. (unstack b19 b17)
   deleted: (on b19 b17) (clear b19) (arm-empty)
   added: (holding b19) (clear b17)
   goals met: 12 of 22
36. (stack b19 b9)
   deleted: (clear b9) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b9)
   goals met: 13 of 22
37. (unstack b14 b12)
   deleted: (on b14 b12) (clear b14) (arm-empty)
   added: (holding b14) (clear b12)
   goals met: 14 of 22
38. (stack b14 b19)
   deleted: (clear b19) (holding b14)
   added: (arm-empty) (clear b14) (on b14 b19)
   goals met: 15 of 22
39. (unstack b4 b21)
   deleted: (on b4 b21) (clear b4) (arm-empty)
   added: (holding b4) (clear b21)
   goals met: 15 of 22
40. (stack b4 b14)
   deleted: (clear b14) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b14)
   goals met: 16 of 22
41. (unstack b16 b8)
   deleted: (on b16 b8) (clear b16) (arm-empty)
   added: (holding b16) (clear b8)
   goals met: 16 of 22
42. (stack b16 b4)
   deleted: (clear b4) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b4)
   goals met: 17 of 22
43. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 16 of 22
44. (stack b12 b2)
   deleted: (clear b2) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b2)
   goals met: 18 of 22
45. (unstack b21 b15)
   deleted: (on b21 b15) (clear b21) (arm-empty)
   added: (holding b21) (clear b15)
   goals met: 18 of 22
46. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 18 of 22
47. (unstack b15 b5)
   deleted: (on b15 b5) (clear b15) (arm-empty)
   added: (holding b15) (clear b5)
   goals met: 18 of 22
48. (stack b15 b8)
   deleted: (clear b8) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b8)
   goals met: 19 of 22
49. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 19 of 22
50. (stack b5 b16)
   deleted: (clear b16) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b16)
   goals met: 20 of 22
51. (pickup b20)
   deleted: (clear b20) (on-table b20) (arm-empty)
   added: (holding b20)
   goals met: 20 of 22
52. (stack b20 b5)
   deleted: (clear b5) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b5)
   goals met: 21 of 22
53. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 20 of 22
54. (stack b13 b15)
   deleted: (clear b15) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b15)
   goals met: 22 of 22
